Tekla Open API Reference for Tekla Structures 2025
ProfileItemCrossSection Properties
The ProfileItemCrossSection type exposes the following members.
Properties
Name | Description
CrossSectionLocation |  Obsolete.
 Gets or sets a value of the property CrossSectionLocation.
CrossSectionNumber |  Obsolete.
 Gets or sets a value of the property CrossSectionNumber.
EquivalentType
 Gets or sets a value of the property EquivalentType.
Location
 Gets or sets a value of the property Location.
Number
 Gets or sets a value of the property Number.
NumberOfProfileItemAnalysisParameters
 Gets or sets a value of the property NumberOfProfileItemAnalysisParameters.
NumberOfProfileItemParameters
 Gets or sets a value of the property NumberOfProfileItemParameters.
NumberOfProfileItemUserParameters
 Gets or sets a value of the property NumberOfProfileItemUserParameters.
ProfileItemAnalysisParameters
 Gets or sets a value of the property ProfileItemAnalysisParameters.
ProfileItemParameters
 Gets or sets a value of the property ProfileItemParameters.
ProfileItemUserParameters
 Gets or sets a value of the property ProfileItemUserParameters.
ProfileSubType
 Gets or sets a value of the property ProfileSubType.
ProfileType
 Gets or sets a value of the property ProfileType.
Top
See Also
Reference
ProfileItemCrossSection Class
Tekla.Structures.Catalogs Namespace